; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-6-25)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	package16 - obj
	package17 - obj
	package18 - obj
	package19 - obj
	package20 - obj
	package21 - obj
	package22 - obj
	package23 - obj
	package24 - obj
	package25 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	s15 - location
	s16 - location
	s17 - location
	s18 - location
	s19 - location
	p0-2 - location
	p0-16 - location
	p1-14 - location
	p1-15 - location
	p2-9 - location
	p2-14 - location
	p2-15 - location
	p3-11 - location
	p3-12 - location
	p4-3 - location
	p4-7 - location
	p4-9 - location
	p4-11 - location
	p4-16 - location
	p5-8 - location
	p5-17 - location
	p6-11 - location
	p7-6 - location
	p7-10 - location
	p7-15 - location
	p7-18 - location
	p7-19 - location
	p8-0 - location
	p8-4 - location
	p10-13 - location
	p12-1 - location
	p13-5 - location
	p13-8 - location
	p13-9 - location
	p13-18 - location
	p14-0 - location
	p14-13 - location
	p14-15 - location
	p15-5 - location
	p15-13 - location
	p16-12 - location
	p18-6 - location
	p19-11 - location
	p19-18 - location
	)
	(:init
	(at driver1 s13)
	(at driver2 s12)
	(at driver3 s19)
	(at driver4 s15)
	(at driver5 s13)
	(at driver6 s0)
	(at driver7 s16)
	(at driver8 s8)
	(at truck1 s13)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s17)
	(empty truck4)
	(at truck5 s16)
	(empty truck5)
	(at truck6 s16)
	(empty truck6)
	(at package1 s18)
	(at package2 s15)
	(at package3 s8)
	(at package4 s2)
	(at package5 s8)
	(at package6 s9)
	(at package7 s15)
	(at package8 s15)
	(at package9 s1)
	(at package10 s3)
	(at package11 s1)
	(at package12 s6)
	(at package13 s16)
	(at package14 s14)
	(at package15 s11)
	(at package16 s17)
	(at package17 s14)
	(at package18 s18)
	(at package19 s0)
	(at package20 s0)
	(at package21 s12)
	(at package22 s11)
	(at package23 s17)
	(at package24 s6)
	(at package25 s8)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-16)
	(path p0-16 s0)
	(path s16 p0-16)
	(path p0-16 s16)
	(path s1 p1-14)
	(path p1-14 s1)
	(path s14 p1-14)
	(path p1-14 s14)
	(path s1 p1-15)
	(path p1-15 s1)
	(path s15 p1-15)
	(path p1-15 s15)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s2 p2-14)
	(path p2-14 s2)
	(path s14 p2-14)
	(path p2-14 s14)
	(path s2 p2-15)
	(path p2-15 s2)
	(path s15 p2-15)
	(path p2-15 s15)
	(path s3 p3-11)
	(path p3-11 s3)
	(path s11 p3-11)
	(path p3-11 s11)
	(path s3 p3-12)
	(path p3-12 s3)
	(path s12 p3-12)
	(path p3-12 s12)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(path s4 p4-16)
	(path p4-16 s4)
	(path s16 p4-16)
	(path p4-16 s16)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s5 p5-17)
	(path p5-17 s5)
	(path s17 p5-17)
	(path p5-17 s17)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s7 p7-15)
	(path p7-15 s7)
	(path s15 p7-15)
	(path p7-15 s15)
	(path s7 p7-18)
	(path p7-18 s7)
	(path s18 p7-18)
	(path p7-18 s18)
	(path s7 p7-19)
	(path p7-19 s7)
	(path s19 p7-19)
	(path p7-19 s19)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s10 p10-13)
	(path p10-13 s10)
	(path s13 p10-13)
	(path p10-13 s13)
	(path s12 p12-1)
	(path p12-1 s12)
	(path s1 p12-1)
	(path p12-1 s1)
	(path s13 p13-5)
	(path p13-5 s13)
	(path s5 p13-5)
	(path p13-5 s5)
	(path s13 p13-8)
	(path p13-8 s13)
	(path s8 p13-8)
	(path p13-8 s8)
	(path s13 p13-9)
	(path p13-9 s13)
	(path s9 p13-9)
	(path p13-9 s9)
	(path s13 p13-18)
	(path p13-18 s13)
	(path s18 p13-18)
	(path p13-18 s18)
	(path s14 p14-0)
	(path p14-0 s14)
	(path s0 p14-0)
	(path p14-0 s0)
	(path s14 p14-13)
	(path p14-13 s14)
	(path s13 p14-13)
	(path p14-13 s13)
	(path s14 p14-15)
	(path p14-15 s14)
	(path s15 p14-15)
	(path p14-15 s15)
	(path s15 p15-5)
	(path p15-5 s15)
	(path s5 p15-5)
	(path p15-5 s5)
	(path s15 p15-13)
	(path p15-13 s15)
	(path s13 p15-13)
	(path p15-13 s13)
	(path s16 p16-12)
	(path p16-12 s16)
	(path s12 p16-12)
	(path p16-12 s12)
	(path s18 p18-6)
	(path p18-6 s18)
	(path s6 p18-6)
	(path p18-6 s6)
	(path s19 p19-11)
	(path p19-11 s19)
	(path s11 p19-11)
	(path p19-11 s11)
	(path s19 p19-18)
	(path p19-18 s19)
	(path s18 p19-18)
	(path p19-18 s18)
	(link s1 s0)
	(link s0 s1)
	(link s1 s6)
	(link s6 s1)
	(link s1 s9)
	(link s9 s1)
	(link s2 s6)
	(link s6 s2)
	(link s2 s18)
	(link s18 s2)
	(link s2 s19)
	(link s19 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s7)
	(link s7 s3)
	(link s3 s11)
	(link s11 s3)
	(link s3 s18)
	(link s18 s3)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s12)
	(link s12 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s9)
	(link s9 s5)
	(link s5 s16)
	(link s16 s5)
	(link s5 s17)
	(link s17 s5)
	(link s6 s3)
	(link s3 s6)
	(link s6 s7)
	(link s7 s6)
	(link s6 s11)
	(link s11 s6)
	(link s6 s12)
	(link s12 s6)
	(link s6 s16)
	(link s16 s6)
	(link s6 s18)
	(link s18 s6)
	(link s7 s4)
	(link s4 s7)
	(link s7 s9)
	(link s9 s7)
	(link s7 s18)
	(link s18 s7)
	(link s8 s0)
	(link s0 s8)
	(link s8 s6)
	(link s6 s8)
	(link s8 s9)
	(link s9 s8)
	(link s8 s10)
	(link s10 s8)
	(link s8 s11)
	(link s11 s8)
	(link s8 s12)
	(link s12 s8)
	(link s8 s15)
	(link s15 s8)
	(link s8 s19)
	(link s19 s8)
	(link s9 s15)
	(link s15 s9)
	(link s9 s18)
	(link s18 s9)
	(link s10 s0)
	(link s0 s10)
	(link s10 s13)
	(link s13 s10)
	(link s10 s15)
	(link s15 s10)
	(link s10 s16)
	(link s16 s10)
	(link s11 s1)
	(link s1 s11)
	(link s11 s5)
	(link s5 s11)
	(link s11 s10)
	(link s10 s11)
	(link s11 s16)
	(link s16 s11)
	(link s12 s1)
	(link s1 s12)
	(link s12 s15)
	(link s15 s12)
	(link s12 s16)
	(link s16 s12)
	(link s13 s2)
	(link s2 s13)
	(link s13 s9)
	(link s9 s13)
	(link s13 s17)
	(link s17 s13)
	(link s14 s2)
	(link s2 s14)
	(link s14 s4)
	(link s4 s14)
	(link s14 s8)
	(link s8 s14)
	(link s15 s4)
	(link s4 s15)
	(link s15 s5)
	(link s5 s15)
	(link s15 s16)
	(link s16 s15)
	(link s15 s17)
	(link s17 s15)
	(link s16 s0)
	(link s0 s16)
	(link s16 s14)
	(link s14 s16)
	(link s16 s17)
	(link s17 s16)
	(link s17 s8)
	(link s8 s17)
	(link s17 s11)
	(link s11 s17)
	(link s18 s12)
	(link s12 s18)
	(link s18 s14)
	(link s14 s18)
	(link s18 s19)
	(link s19 s18)
	(link s19 s6)
	(link s6 s19)
	(link s19 s10)
	(link s10 s19)
)
	(:goal (and
	(at driver1 s13)
	(at driver2 s6)
	(at driver3 s15)
	(at driver5 s6)
	(at driver6 s5)
	(at driver7 s8)
	(at truck3 s5)
	(at truck4 s18)
	(at truck6 s12)
	(at package1 s6)
	(at package2 s7)
	(at package3 s3)
	(at package4 s11)
	(at package5 s5)
	(at package6 s14)
	(at package7 s19)
	(at package8 s16)
	(at package9 s13)
	(at package10 s9)
	(at package11 s7)
	(at package12 s3)
	(at package13 s11)
	(at package14 s14)
	(at package15 s2)
	(at package16 s12)
	(at package18 s2)
	(at package19 s4)
	(at package20 s7)
	(at package21 s8)
	(at package22 s14)
	(at package23 s10)
	(at package24 s4)
	(at package25 s16)
	))

)

; plan
1. (walk driver4 s15 p1-15)
   deleted: (at driver4 s15)
   added: (at driver4 p1-15)
   goals met: 3 of 33
2. (board-truck driver7 truck6 s16)
   deleted: (at driver7 s16) (empty truck6)
   added: (driving driver7 truck6)
   goals met: 3 of 33
3. (drive-truck truck6 s16 s12 driver7)
   deleted: (at truck6 s16)
   added: (at truck6 s12)
   goals met: 4 of 33
4. (drive-truck truck6 s12 s8 driver7)
   deleted: (at truck6 s12)
   added: (at truck6 s8)
   goals met: 3 of 33
5. (disembark-truck driver7 truck6 s8)
   deleted: (driving driver7 truck6)
   added: (at driver7 s8) (empty truck6)
   goals met: 4 of 33
6. (walk driver3 s19 p7-19)
   deleted: (at driver3 s19)
   added: (at driver3 p7-19)
   goals met: 4 of 33
7. (walk driver3 p7-19 s7)
   deleted: (at driver3 p7-19)
   added: (at driver3 s7)
   goals met: 4 of 33
8. (walk driver3 s7 p7-15)
   deleted: (at driver3 s7)
   added: (at driver3 p7-15)
   goals met: 4 of 33
9. (walk driver3 p7-15 s15)
   deleted: (at driver3 p7-15)
   added: (at driver3 s15)
   goals met: 5 of 33
10. (walk driver5 s13 p13-18)
   deleted: (at driver5 s13)
   added: (at driver5 p13-18)
   goals met: 5 of 33
11. (walk driver5 p13-18 s18)
   deleted: (at driver5 p13-18)
   added: (at driver5 s18)
   goals met: 5 of 33
12. (walk driver5 s18 p18-6)
   deleted: (at driver5 s18)
   added: (at driver5 p18-6)
   goals met: 5 of 33
13. (walk driver5 p18-6 s6)
   deleted: (at driver5 p18-6)
   added: (at driver5 s6)
   goals met: 6 of 33
14. (walk driver6 s0 p8-0)
   deleted: (at driver6 s0)
   added: (at driver6 p8-0)
   goals met: 6 of 33
15. (walk driver6 p8-0 s8)
   deleted: (at driver6 p8-0)
   added: (at driver6 s8)
   goals met: 6 of 33
16. (walk driver6 s8 p5-8)
   deleted: (at driver6 s8)
   added: (at driver6 p5-8)
   goals met: 6 of 33
17. (walk driver6 p5-8 s5)
   deleted: (at driver6 p5-8)
   added: (at driver6 s5)
   goals met: 7 of 33
18. (board-truck driver8 truck6 s8)
   deleted: (at driver8 s8) (empty truck6)
   added: (driving driver8 truck6)
   goals met: 7 of 33
19. (drive-truck truck6 s8 s12 driver8)
   deleted: (at truck6 s8)
   added: (at truck6 s12)
   goals met: 8 of 33
20. (load-truck package21 truck6 s12)
   deleted: (at package21 s12)
   added: (in package21 truck6)
   goals met: 8 of 33
21. (drive-truck truck6 s12 s8 driver8)
   deleted: (at truck6 s12)
   added: (at truck6 s8)
   goals met: 7 of 33
22. (unload-truck package21 truck6 s8)
   deleted: (in package21 truck6)
   added: (at package21 s8)
   goals met: 8 of 33
23. (drive-truck truck6 s8 s15 driver8)
   deleted: (at truck6 s8)
   added: (at truck6 s15)
   goals met: 8 of 33
24. (load-truck package8 truck6 s15)
   deleted: (at package8 s15)
   added: (in package8 truck6)
   goals met: 8 of 33
25. (load-truck package7 truck6 s15)
   deleted: (at package7 s15)
   added: (in package7 truck6)
   goals met: 8 of 33
26. (load-truck package2 truck6 s15)
   deleted: (at package2 s15)
   added: (in package2 truck6)
   goals met: 8 of 33
27. (drive-truck truck6 s15 s12 driver8)
   deleted: (at truck6 s15)
   added: (at truck6 s12)
   goals met: 9 of 33
28. (drive-truck truck6 s12 s1 driver8)
   deleted: (at truck6 s12)
   added: (at truck6 s1)
   goals met: 8 of 33
29. (load-truck package9 truck6 s1)
   deleted: (at package9 s1)
   added: (in package9 truck6)
   goals met: 8 of 33
30. (load-truck package11 truck6 s1)
   deleted: (at package11 s1)
   added: (in package11 truck6)
   goals met: 8 of 33
31. (drive-truck truck6 s1 s6 driver8)
   deleted: (at truck6 s1)
   added: (at truck6 s6)
   goals met: 8 of 33
32. (load-truck package24 truck6 s6)
   deleted: (at package24 s6)
   added: (in package24 truck6)
   goals met: 8 of 33
33. (load-truck package12 truck6 s6)
   deleted: (at package12 s6)
   added: (in package12 truck6)
   goals met: 8 of 33
34. (walk driver6 s5 p5-17)
   deleted: (at driver6 s5)
   added: (at driver6 p5-17)
   goals met: 7 of 33
35. (drive-truck truck6 s6 s8 driver8)
   deleted: (at truck6 s6)
   added: (at truck6 s8)
   goals met: 7 of 33
36. (load-truck package5 truck6 s8)
   deleted: (at package5 s8)
   added: (in package5 truck6)
   goals met: 7 of 33
37. (load-truck package3 truck6 s8)
   deleted: (at package3 s8)
   added: (in package3 truck6)
   goals met: 7 of 33
38. (load-truck package25 truck6 s8)
   deleted: (at package25 s8)
   added: (in package25 truck6)
   goals met: 7 of 33
39. (drive-truck truck6 s8 s12 driver8)
   deleted: (at truck6 s8)
   added: (at truck6 s12)
   goals met: 8 of 33
40. (drive-truck truck6 s12 s16 driver8)
   deleted: (at truck6 s12)
   added: (at truck6 s16)
   goals met: 7 of 33
41. (unload-truck package8 truck6 s16)
   deleted: (in package8 truck6)
   added: (at package8 s16)
   goals met: 8 of 33
42. (unload-truck package25 truck6 s16)
   deleted: (in package25 truck6)
   added: (at package25 s16)
   goals met: 9 of 33
43. (load-truck package13 truck6 s16)
   deleted: (at package13 s16)
   added: (in package13 truck6)
   goals met: 9 of 33
44. (drive-truck truck6 s16 s6 driver8)
   deleted: (at truck6 s16)
   added: (at truck6 s6)
   goals met: 9 of 33
45. (drive-truck truck6 s6 s3 driver8)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   goals met: 9 of 33
46. (unload-truck package3 truck6 s3)
   deleted: (in package3 truck6)
   added: (at package3 s3)
   goals met: 10 of 33
47. (unload-truck package12 truck6 s3)
   deleted: (in package12 truck6)
   added: (at package12 s3)
   goals met: 11 of 33
48. (load-truck package10 truck6 s3)
   deleted: (at package10 s3)
   added: (in package10 truck6)
   goals met: 11 of 33
49. (drive-truck truck6 s3 s11 driver8)
   deleted: (at truck6 s3)
   added: (at truck6 s11)
   goals met: 11 of 33
50. (load-truck package22 truck6 s11)
   deleted: (at package22 s11)
   added: (in package22 truck6)
   goals met: 11 of 33
51. (load-truck package15 truck6 s11)
   deleted: (at package15 s11)
   added: (in package15 truck6)
   goals met: 11 of 33
52. (unload-truck package13 truck6 s11)
   deleted: (in package13 truck6)
   added: (at package13 s11)
   goals met: 12 of 33
53. (drive-truck truck6 s11 s6 driver8)
   deleted: (at truck6 s11)
   added: (at truck6 s6)
   goals met: 12 of 33
54. (drive-truck truck6 s6 s12 driver8)
   deleted: (at truck6 s6)
   added: (at truck6 s12)
   goals met: 13 of 33
55. (walk driver6 p5-17 s17)
   deleted: (at driver6 p5-17)
   added: (at driver6 s17)
   goals met: 13 of 33
56. (board-truck driver6 truck4 s17)
   deleted: (at driver6 s17) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 13 of 33
57. (load-truck package23 truck4 s17)
   deleted: (at package23 s17)
   added: (in package23 truck4)
   goals met: 13 of 33
58. (load-truck package16 truck4 s17)
   deleted: (at package16 s17)
   added: (in package16 truck4)
   goals met: 13 of 33
59. (drive-truck truck4 s17 s11 driver6)
   deleted: (at truck4 s17)
   added: (at truck4 s11)
   goals met: 13 of 33
60. (drive-truck truck6 s12 s4 driver8)
   deleted: (at truck6 s12)
   added: (at truck6 s4)
   goals met: 12 of 33
61. (drive-truck truck4 s11 s6 driver6)
   deleted: (at truck4 s11)
   added: (at truck4 s6)
   goals met: 12 of 33
62. (unload-truck package24 truck6 s4)
   deleted: (in package24 truck6)
   added: (at package24 s4)
   goals met: 13 of 33
63. (drive-truck truck4 s6 s18 driver6)
   deleted: (at truck4 s6)
   added: (at truck4 s18)
   goals met: 14 of 33
64. (load-truck package18 truck4 s18)
   deleted: (at package18 s18)
   added: (in package18 truck4)
   goals met: 14 of 33
65. (load-truck package1 truck4 s18)
   deleted: (at package1 s18)
   added: (in package1 truck4)
   goals met: 14 of 33
66. (drive-truck truck4 s18 s12 driver6)
   deleted: (at truck4 s18)
   added: (at truck4 s12)
   goals met: 13 of 33
67. (unload-truck package16 truck4 s12)
   deleted: (in package16 truck4)
   added: (at package16 s12)
   goals met: 14 of 33
68. (disembark-truck driver6 truck4 s12)
   deleted: (driving driver6 truck4)
   added: (at driver6 s12) (empty truck4)
   goals met: 14 of 33
69. (board-truck driver2 truck4 s12)
   deleted: (at driver2 s12) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 14 of 33
70. (drive-truck truck4 s12 s18 driver2)
   deleted: (at truck4 s12)
   added: (at truck4 s18)
   goals met: 15 of 33
71. (drive-truck truck4 s18 s19 driver2)
   deleted: (at truck4 s18)
   added: (at truck4 s19)
   goals met: 14 of 33
72. (drive-truck truck4 s19 s2 driver2)
   deleted: (at truck4 s19)
   added: (at truck4 s2)
   goals met: 14 of 33
73. (load-truck package4 truck4 s2)
   deleted: (at package4 s2)
   added: (in package4 truck4)
   goals met: 14 of 33
74. (unload-truck package18 truck4 s2)
   deleted: (in package18 truck4)
   added: (at package18 s2)
   goals met: 15 of 33
75. (drive-truck truck4 s2 s19 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s19)
   goals met: 15 of 33
76. (drive-truck truck4 s19 s10 driver2)
   deleted: (at truck4 s19)
   added: (at truck4 s10)
   goals met: 15 of 33
77. (unload-truck package23 truck4 s10)
   deleted: (in package23 truck4)
   added: (at package23 s10)
   goals met: 16 of 33
78. (drive-truck truck4 s10 s11 driver2)
   deleted: (at truck4 s10)
   added: (at truck4 s11)
   goals met: 16 of 33
79. (unload-truck package4 truck4 s11)
   deleted: (in package4 truck4)
   added: (at package4 s11)
   goals met: 17 of 33
80. (drive-truck truck4 s11 s6 driver2)
   deleted: (at truck4 s11)
   added: (at truck4 s6)
   goals met: 17 of 33
81. (unload-truck package1 truck4 s6)
   deleted: (in package1 truck4)
   added: (at package1 s6)
   goals met: 18 of 33
82. (drive-truck truck6 s4 s5 driver8)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 18 of 33
83. (unload-truck package5 truck6 s5)
   deleted: (in package5 truck6)
   added: (at package5 s5)
   goals met: 19 of 33
84. (drive-truck truck6 s5 s9 driver8)
   deleted: (at truck6 s5)
   added: (at truck6 s9)
   goals met: 19 of 33
85. (disembark-truck driver2 truck4 s6)
   deleted: (driving driver2 truck4)
   added: (at driver2 s6) (empty truck4)
   goals met: 20 of 33
86. (load-truck package6 truck6 s9)
   deleted: (at package6 s9)
   added: (in package6 truck6)
   goals met: 20 of 33
87. (unload-truck package10 truck6 s9)
   deleted: (in package10 truck6)
   added: (at package10 s9)
   goals met: 21 of 33
88. (drive-truck truck6 s9 s18 driver8)
   deleted: (at truck6 s9)
   added: (at truck6 s18)
   goals met: 21 of 33
89. (drive-truck truck6 s18 s14 driver8)
   deleted: (at truck6 s18)
   added: (at truck6 s14)
   goals met: 21 of 33
90. (unload-truck package6 truck6 s14)
   deleted: (in package6 truck6)
   added: (at package6 s14)
   goals met: 22 of 33
91. (unload-truck package22 truck6 s14)
   deleted: (in package22 truck6)
   added: (at package22 s14)
   goals met: 23 of 33
92. (drive-truck truck6 s14 s8 driver8)
   deleted: (at truck6 s14)
   added: (at truck6 s8)
   goals met: 23 of 33
93. (drive-truck truck6 s8 s19 driver8)
   deleted: (at truck6 s8)
   added: (at truck6 s19)
   goals met: 23 of 33
94. (unload-truck package7 truck6 s19)
   deleted: (in package7 truck6)
   added: (at package7 s19)
   goals met: 24 of 33
95. (drive-truck truck6 s19 s8 driver8)
   deleted: (at truck6 s19)
   added: (at truck6 s8)
   goals met: 24 of 33
96. (drive-truck truck6 s8 s9 driver8)
   deleted: (at truck6 s8)
   added: (at truck6 s9)
   goals met: 24 of 33
97. (drive-truck truck6 s9 s5 driver8)
   deleted: (at truck6 s9)
   added: (at truck6 s5)
   goals met: 24 of 33
98. (drive-truck truck6 s5 s0 driver8)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   goals met: 24 of 33
99. (load-truck package20 truck6 s0)
   deleted: (at package20 s0)
   added: (in package20 truck6)
   goals met: 24 of 33
100. (load-truck package19 truck6 s0)
   deleted: (at package19 s0)
   added: (in package19 truck6)
   goals met: 24 of 33
101. (drive-truck truck6 s0 s5 driver8)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   goals met: 24 of 33
102. (drive-truck truck6 s5 s4 driver8)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   goals met: 24 of 33
103. (unload-truck package19 truck6 s4)
   deleted: (in package19 truck6)
   added: (at package19 s4)
   goals met: 25 of 33
104. (board-truck driver5 truck4 s6)
   deleted: (at driver5 s6) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 24 of 33
105. (drive-truck truck6 s4 s7 driver8)
   deleted: (at truck6 s4)
   added: (at truck6 s7)
   goals met: 24 of 33
106. (unload-truck package20 truck6 s7)
   deleted: (in package20 truck6)
   added: (at package20 s7)
   goals met: 25 of 33
107. (unload-truck package2 truck6 s7)
   deleted: (in package2 truck6)
   added: (at package2 s7)
   goals met: 26 of 33
108. (unload-truck package11 truck6 s7)
   deleted: (in package11 truck6)
   added: (at package11 s7)
   goals met: 27 of 33
109. (drive-truck truck6 s7 s9 driver8)
   deleted: (at truck6 s7)
   added: (at truck6 s9)
   goals met: 27 of 33
110. (drive-truck truck6 s9 s13 driver8)
   deleted: (at truck6 s9)
   added: (at truck6 s13)
   goals met: 27 of 33
111. (unload-truck package9 truck6 s13)
   deleted: (in package9 truck6)
   added: (at package9 s13)
   goals met: 28 of 33
112. (drive-truck truck6 s13 s2 driver8)
   deleted: (at truck6 s13)
   added: (at truck6 s2)
   goals met: 28 of 33
113. (unload-truck package15 truck6 s2)
   deleted: (in package15 truck6)
   added: (at package15 s2)
   goals met: 29 of 33
114. (drive-truck truck6 s2 s6 driver8)
   deleted: (at truck6 s2)
   added: (at truck6 s6)
   goals met: 29 of 33
115. (drive-truck truck4 s6 s18 driver5)
   deleted: (at truck4 s6)
   added: (at truck4 s18)
   goals met: 30 of 33
116. (disembark-truck driver5 truck4 s18)
   deleted: (driving driver5 truck4)
   added: (at driver5 s18) (empty truck4)
   goals met: 30 of 33
117. (walk driver5 s18 p18-6)
   deleted: (at driver5 s18)
   added: (at driver5 p18-6)
   goals met: 30 of 33
118. (walk driver5 p18-6 s6)
   deleted: (at driver5 p18-6)
   added: (at driver5 s6)
   goals met: 31 of 33
119. (drive-truck truck6 s6 s3 driver8)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   goals met: 31 of 33
120. (walk driver6 s12 p3-12)
   deleted: (at driver6 s12)
   added: (at driver6 p3-12)
   goals met: 31 of 33
121. (walk driver6 p3-12 s3)
   deleted: (at driver6 p3-12)
   added: (at driver6 s3)
   goals met: 31 of 33
122. (drive-truck truck6 s3 s5 driver8)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   goals met: 31 of 33
123. (drive-truck truck6 s5 s4 driver8)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   goals met: 31 of 33
124. (disembark-truck driver8 truck6 s4)
   deleted: (driving driver8 truck6)
   added: (at driver8 s4) (empty truck6)
   goals met: 31 of 33
125. (walk driver6 s3 p4-3)
   deleted: (at driver6 s3)
   added: (at driver6 p4-3)
   goals met: 31 of 33
126. (walk driver6 p4-3 s4)
   deleted: (at driver6 p4-3)
   added: (at driver6 s4)
   goals met: 31 of 33
127. (board-truck driver8 truck6 s4)
   deleted: (at driver8 s4) (empty truck6)
   added: (driving driver8 truck6)
   goals met: 31 of 33
128. (drive-truck truck6 s4 s12 driver8)
   deleted: (at truck6 s4)
   added: (at truck6 s12)
   goals met: 32 of 33
129. (walk driver6 s4 p8-4)
   deleted: (at driver6 s4)
   added: (at driver6 p8-4)
   goals met: 32 of 33
130. (walk driver6 p8-4 s8)
   deleted: (at driver6 p8-4)
   added: (at driver6 s8)
   goals met: 32 of 33
131. (walk driver6 s8 p5-8)
   deleted: (at driver6 s8)
   added: (at driver6 p5-8)
   goals met: 32 of 33
132. (walk driver6 p5-8 s5)
   deleted: (at driver6 p5-8)
   added: (at driver6 s5)
   goals met: 33 of 33
